#!/usr/bin/env bash
#-------------------------------------------------------------#
#		Sublime Text 初始化脚本			      #
#-------------------------------------------------------------#

# --------------------------引入脚本--------------------------- #

# 重置函数脚本
# 重置函数脚本中同时引入了 subl_start_close_func.sh 脚本

# 初始化函数脚本
# 初始化函数脚本已经引入了 subl_reset_func.sh 函数脚本
source ./subl_init_func.sh

#---------------------------主代码区--------------------------#

# -------------------------------执行区#------------------------------- #

# 初始化主函数
init_main
