
#-------------------------------------------------------------#
#		Sublime Text 初始化脚本			      #
#-------------------------------------------------------------#

#--------------------------引入脚本---------------------------#

# 重置
source ./subl_reset.sh

# 初始化
source ./subl_init_main.sh

#---------------------------主代码区--------------------------#

# 复制 settings
subl_cp_settings

# 安装 Package Control
install_packagecontrol

echo -e "\e[96m 初始化完成！\n \e[0m"

# 重启Sublime Text
subl_restart


#-------------------------------------------------------------#





