
# -------------------------------------------------------- #
# 			重置
# -------------------------------------------------------- #

# -----------------------引入相关脚本--------------------- #
# 关闭重启等
source ./subl_start_close.sh

# 重置核心 
# 主要是删除 Sublime Text 相关的目录
source ./subl_reset_main.sh

# -----------------------主代码区------------------------- #

echo -e "\e[96m 重置 Sublime... \e[0m"

# 关闭 Sublime Text
subl_close

# 删除 Sublime Text 相关目录
delete_subl_dir

echo -e "\e[96m 现在重新启动 SublimeText... \e[0m"
# 重启
subl_restart


# ------------------------------------------------------------------ #

